---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsPipeJointtypeParam
source: html/75f0ccb7-eb19-bd3b-ca7b-7720670e70c8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsPipeJointtypeParam Property

"Connection Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsPipeJointtypeParam { get; }
```